books = [
	{'title': "Индиана Джонс и Храм Судьбы", 'author': "Вейн Сьюзан", 'year': 2008},
	{'title': "Робинзон Крузо", 'author': "Даниель Дефо", 'year': 1719},
	{'title': "Война и мир", 'author': "Лев Толстой", 'year':1869 },
	{'title': "Дом в котором", 'author': "Мариам Петросян", 'year': 2009},
	{'title': "Мёртвые души", 'author': "Николай Гоголь", 'year': 1842}]
for i in range(len(books)):
    print(f"---------------------------------- Книга {i + 1} -------------------------------------")
    print(f"Название: {books[i]['title']}, Автор: {books[i]['author']},")
    print(f"------------------------------------{books[i]['year']}----------------------------------------")